In [1]:
import pandas as pd

# None 、 NaN 、pd.NA 都是缺失值

# 10.3.1 指定值替换

In [12]:
s = pd.Series([0.,1.,2.,3.,4.,0])

In [13]:
s

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    0.0
dtype: float64

In [14]:
# 值替换
s.replace(0,5)

0    5.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [15]:
# 一一对应替换值（批量）
s.replace([0.,1.,2.,3.,4.],[4,43,44,3,1])

0     4.0
1    43.0
2    44.0
3     3.0
4     1.0
5     4.0
dtype: float64

In [16]:
# 字典映射对应替换值（批量）
s.replace({0:100,1:200})

0    100.0
1    200.0
2      2.0
3      3.0
4      4.0
5    100.0
dtype: float64

In [18]:
df = pd.read_excel("../team2.xlsx")
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [19]:
# 将某列某值替换为统一的100
df.replace({'Q1':93, 'Q4':5},100)

     name team   Q1  Q2  Q3   Q4     1city what color
0   Liver    E   89  21  24    1  shanghai     yellew
1    Arry    C   55  37  37    2    nanjin        red
2     Ack    A   57  60  33    3    beijin     purple
3   Eorge    C  100   4  71    4   tianjin       blue
4     Oah    D  100  49  44  100     henan      black
5  Harlie    C   24  13  87    6     hebei       pink

In [22]:
# 将某列某值替换成指定的值
df.replace({'Q1':{93:200, 55:300}, 'Q4':{1:11, 2:22}})

     name team   Q1  Q2  Q3  Q4     1city what color
0   Liver    E   89  21  24  11  shanghai     yellew
1    Arry    C  300  37  37  22    nanjin        red
2     Ack    A   57  60  33   3    beijin     purple
3   Eorge    C  200   4  71   4   tianjin       blue
4     Oah    D  200  49  44   5     henan      black
5  Harlie    C   24  13  87   6     hebei       pink

# 10.3.2 使用替换方式

In [23]:
s

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    0.0
dtype: float64

In [25]:
# 将值1，2，3替换成它们前一个值，即0
# s.replace([1,2,3],method='pad')
s.replace([1,2,3],method='ffill')

0    0.0
1    0.0
2    0.0
3    0.0
4    4.0
5    0.0
dtype: float64

In [26]:
# 将值1，2，3替换成它们后一个值，即4
s.replace([1,2,3],method='bfill')

0    0.0
1    4.0
2    4.0
3    4.0
4    4.0
5    0.0
dtype: float64

In [27]:
# 如果指定要替换的值不存在，则不起作用，也不会报错，以上替换也适用字符类型数据。
s.replace([5],method='bfill')

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    0.0
dtype: float64

In [32]:
s = pd.Series([0.,None,2.,3.,4.,None])
s

0    0.0
1    NaN
2    2.0
3    3.0
4    4.0
5    NaN
dtype: float64

In [33]:
# 2替换成了NaN，4替换成了3
s.replace([2,4],method='ffill')

0    0.0
1    NaN
2    NaN
3    3.0
4    3.0
5    NaN
dtype: float64

In [34]:
s.replace([3,4],method='bfill')

0    0.0
1    NaN
2    2.0
3    NaN
4    NaN
5    NaN
dtype: float64

# 10.3.3 字符替换

In [35]:
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [37]:
# 替换方式默认没有开启正则
df.replace(to_replace='red', value='ok')
# df.replace('red', 'ok')  同上

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin         ok
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [39]:
# 对所有列进行正则将jin结尾的值替换为new
df.replace(to_replace=r'jin$' , value='new', regex=True)

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nannew        red
2     Ack    A  57  60  33   3    beinew     purple
3   Eorge    C  93   4  71   4   tiannew       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [44]:
# 对所有列进行正则e替换为1
df.replace(to_replace=r'e' , value='1', regex=True)

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liv1r    E  89  21  24   1  shanghai     y1ll1w
1    Arry    C  55  37  37   2    nanjin        r1d
2     Ack    A  57  60  33   3    b1ijin     purpl1
3   Eorg1    C  93   4  71   4   tianjin       blu1
4     Oah    D  93  49  44   5     h1nan      black
5  Harli1    C  24  13  87   6     h1b1i       pink

In [45]:
# 对指定列（1city）进行正则e替换为2
df.replace({'1city': r'e'},{'1city': r'2'}, regex=True)

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    b2ijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     h2nan      black
5  Harlie    C  24  13  87   6     h2b2i       pink

In [47]:
# 对所有列进行多个正则替换同样的值
df.replace(regex=[r'^y','jin$'], value='3')

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     3ellew
1    Arry    C  55  37  37   2      nan3        red
2     Ack    A  57  60  33   3      bei3     purple
3   Eorge    C  93   4  71   4     tian3       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [52]:
# 对所有列进行多个正则替换对应的值
df.replace(regex={r'^y':'4', r'jin$':'5'})

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     4ellew
1    Arry    C  55  37  37   2      nan5        red
2     Ack    A  57  60  33   3      bei5     purple
3   Eorge    C  93   4  71   4     tian5       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

# 10.3.4 缺失值替换

In [56]:
import numpy as np
d={'a':list(range(4)),
  'b':list('ab..'),
  'c':['a','b', None, 'd']}

In [57]:
df = pd.DataFrame(d)
df

   a  b     c
0  0  a     a
1  1  b     b
2  2  .  None
3  3  .     d

In [59]:
# 将.替换成NaN
df.replace('.', np.nan)

   a    b     c
0  0    a     a
1  1    b     b
2  2  NaN  None
3  3  NaN     d

In [64]:
# 使用正则，将.替换成NaN
df.replace(r'\s*\.\s*', np.nan, regex=True)

   a  b     c
0  0  a     a
1  1  b     b
2  2  .  None
3  3  .     d

In [65]:
# 对应值替换 a换b， .换NaN
df.replace(['a','.'],['b', np.nan])

   a    b     c
0  0    b     b
1  1    b     b
2  2  NaN  None
3  3  NaN     d

In [71]:
s = pd.Series([10,'a','a','b','a'])
s

0    10
1     a
2     a
3     b
4     a
dtype: object

In [72]:
s.replace({'a':None})

0      10
1    None
2    None
3       b
4    None
dtype: object

In [73]:
s.replace('a',None)

0      10
1    None
2    None
3       b
4    None
dtype: object

# 10.3.6 数据修剪

In [74]:
df = pd.DataFrame({'a':[1,2,5], 'b':[6,1,-3]})
df

   a  b
0  1  6
1  2  1
2  5 -3

In [75]:
# a、b列中小0用0替换，大于3的用3替换
# a = 1,2,3
# b = 3,1,0
df.clip(0,3)

   a  b
0  1  3
1  2  1
2  3  0

In [76]:
c = pd.Series([-1,1,3])
c

0   -1
1    1
2    3
dtype: int64

In [81]:
# 没理解？？？
df.clip(c,c+1, axis=0)

   a  b
0  0  0
1  2  1
2  4  3